Revit 2027 API
UIControlledApplication.ThemeChanged Event
 Subscribe to the ThemeChanged event to be notified after the theme was changed.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<ThemeChangedEventArgs> ThemeChanged
Public Event ThemeChanged As EventHandler(Of ThemeChangedEventArgs)
public:
 event EventHandler<ThemeChangedEventArgs^>^ ThemeChanged {
	void add (EventHandler<ThemeChangedEventArgs^>^ value);
	void remove (EventHandler<ThemeChangedEventArgs^>^ value);
}
member ThemeChanged : IEvent<EventHandler<ThemeChangedEventArgs>,
    ThemeChangedEventArgs>
Value
EventHandler<ThemeChangedEventArgs>
Remarks
This event is raised after the theme was changed.
See Also
Reference
UIControlledApplication Class
Autodesk.Revit.UI Namespace